{
    "can_do": [
        "**Defining words and phrases/idioms: **I can provide up to five definitions for any word or phrase from either Russian or English using Wiktionary. The definition(s) will always be in English, will include transcription, and may include examples of use.\n\n<:bullet:1085297383434363051> To use this feature, type in */define [word or phrase] [part of speech]* in a text channel. For a more precise search, you can specify the part of speech by typing in */define [word or phrase] [part of speech].*\n\n**Looking up words from Urban Dictionary:** if you feel rather slangy, I can also look up definitions from Urban Dictionary.\n\n<:bullet:1085297383434363051> To use this feature, type in */urban [word or phrase]* in a text channel.\n\n**Translation**: I can translate any text from one language into another using DeepL Translator.\n\n<:bullet:1085297383434363051> To use this feature, type in */translate [target language code] [text to translate]* in a text channel. Additionally, you can narrow down the search and specify the source language by typing in */translate [target language code] [text to translate] [source language code].* \n<:bullet:1085297383434363051> You can access the list of language codes supported by DeepL Translator using */translate_help*.\n\n**Creating voice channels:** I can create temporary voice channels for users where you can set the channel name and user limit and subsequently, edit those as you see fit. Additionally, I allow the user to ban/unban other users from the channel and lock/unlock the channel. \n\n<:bullet:1085297383434363051> To create a temporary voice channel, you must first join the \"Create room\" voice channel, type in */voice_create [user limit] [channel name]* in a text channel (preferably the text chat of the \"Create room\" voice channel). \n<:bullet:1085297383434363051> To change the user limit of your personal voice channel, type in */voice_limit [new limit]*. \n<:bullet:1085297383434363051> To rename your personal voice channel, type in */voice_rename [new name]*. \n<:bullet:1085297383434363051> To ban or unban a user from your personal voice channel, type in */voice_ban [user]* or */voice_unban [user]* respectively. \n<:bullet:1085297383434363051> To lock or unlock your personal voice channel, type in */voice_lock* or */voice_unlock* respectively.",
        "**Давать определения словам и фразам/фразеологизмам:** я могу дать до пяти определений любому слову или фразе из русского или английского языков, используя Викисловарь. Определения даются исключительно на английском языке, содержат транскрипцию и, по возможности, примеры использования. \n\n<:bullet:1085297383434363051> Чтобы воспользоваться этой функцией, введите команду */define [слово или фраза]* в любом текстовом канале. Для более точного поиска можно также уточнить часть речи искомого слова, введя команду */define [слово или фраза] [часть речи].*\n\n**Искать слова из Urban Dictionary:** если это что-то сленговое и/или противоречащее литературной норме английского языка, я также могу дать определение из Urban Dictionary.\n\n<:bullet:1085297383434363051> Чтобы воспользоваться этой функцией, введите команду */urban [слово или фраза]* в любом текстовом канале.\n\n**Переводить:** я могу перевести любой текст с одного языка на другой через переводчик DeepL.\n\n<:bullet:1085297383434363051> Чтобы воспользоваться этой функцией, введите команду */translate [код языка перевода] [Ваш текст]* в любом текстовом канале. Кроме того, можно уточнить язык, с которого осуществляется перевод, введя команду */translate [код языка перевода] [Ваш текст] [код переводимого языка].*\n<:bullet:1085297383434363051> Со списком кодов языков, поддерживаемых переводчиком DeepL, можно ознакомиться при помощи команды */translate_help.*\n\n**Создавать голосовые каналы:** я могу создавать временные голосовые каналы, где можно настроить максимально допустимое количество пользователей, редактировать название канала, а также ограничить/разрешить доступ или заблокировать/разблокировать канал.\n\n<:bullet:1085297383434363051> Для создания голосового канала необходимо сначала зайти в голосовой канал \"Create room\", затем ввести команду */voice_create [максимальное количество пользователей] [название канала]* в любом текстовом канале (желательно во встроенном чате голосового канала \"Create room\"). \n<:bullet:1085297383434363051> Чтобы переименовать созданный канал, введите команду */voice_rename [название канала]*. \n<:bullet:1085297383434363051> Чтобы изменить максимальное количество пользователей созданного канала, введите команду */voice_limit [количество пользователей]*. \n<:bullet:1085297383434363051> Чтобы ограничить/разрешить доступ конкретному пользователю к созданному каналу, введите команду */voice_ban [имя пользователя]* или */voice_unban [имя пользователя]* соответственно. \n<:bullet:1085297383434363051> Чтобы закрыть/открыть доступ к созданному каналу, введите команду */voice_lock* или */voice_unlock* соответственно.",
        "Welcome to #bot-info! <:Calcifer_wave:1088844908187615313>\nI'm your friendly neighborhood Calcifer, and you'll find a list of my available commands right here down below. Feel free to use my features, but please avoid excessive use in the 'Social' and 'Learning' categories. If you'd like to experiment or use my commands without any restrictions, head over to the #bot-commands channel. Just a heads up: if you don't follow these guidelines, you might face consequences, like getting muted. \nThanks for understanding, and enjoy exploring the variety of features I offer!",
        "Привет! <:Calcifer_wave:1088844908187615313>\nЯ - Кальцифер, личный бот этого сервера, а ниже Вы можете ознакомиться со списком всего, что я умею. Пользуйтесь командами на своё усмотрение, но не увлекайтесь чрезмерным спамом в таких категориях как \"Social\" и \"Learning\", в противном случае Вас может ждать наказание вплоть до ограничения на отправление сообщений. В канале #bot-commands, однако, Вы можете дать простор фантазии и пользоваться всем моим функционалом сколько угодно. \nСпасибо за понимание и приятного использования!"
    ],
    "help": "",
    "help_translate": {
        "description": "**Here is the list of all languages you can translate your text into using the \"/translate\" command:**",
        "langs": {
            "bg": "Bulgarian",
            "cz": "Czech",
            "da": "Danish",
            "de": "German",
            "el": "Greek",
            "en-gb": "English (British)",
            "en-us": "English (American)",
            "es": "Spanish",
            "et": "Estonian",
            "fi": "Finnish",
            "fr": "French",
            "hu": "Hungarian",
            "id": "Indonesian",
            "it": "Italian",
            "ja": "Japanese",
            "ko": "Korean",
            "lt": "Lithuanian",
            "lv": "Latvian",
            "nb": "Norwegian (Bokmal)",
            "nl": "Dutch",
            "pl": "Polish",
            "pt-br": "Portuguese (Brazilian)",
            "pt-pt": "Portuguese (Portugal)",
            "ro": "Romanian",
            "ru": "Russian",
            "sk": "Slovak",
            "sl": "Slovenian",
            "sv": "Swedish",
            "tr": "Turkish",
            "uk": "Ukrainian",
            "zh": "Chinese (simplified)"
        }
    },
    "nigger" : {
        "en" : "Welcome to the #language-questions channel, where you can ask questions about grammar, pronunciation, word usage, and other aspects of both Russian and English. You can also request feedback on your handwriting, ask for corrections on small texts (**for longer texts, please refer to the #proofreading channel**), and more.\nTo make the most of this channel and maintain organization, follow these steps:\n\n**1.**  Create a post with the issue you need help with. Be clear and specific. Apply a relevant tag to help others understand which language you need help with.\n\n**2.** Wait for other users to respond with answers, corrections, or explanations.\n\n**3.** If the matter was sufficiently addressed, use the */resolved* command in your post. Our bot <@1081285777562013817> will then lock your post and add a \"<:pyre_check:1085562978713219175> Resolved\" tag, keeping the channel organized and easy to navigate.\n\nHave fun learning!",
        "ru" : "В этом канале Вы можете задавать вопросы про грамматику, произношение, правильное употребление слов и прочие аспекты русского и английского языков, а также делиться своими текстами на проверку, но при условии, что они не слишком большие; **в противном случае воспользуйтесь каналом #proofreading.**\nДля максимально эффективного использования этого канала постарайтесь придерживаться следующего алгоритма действий:\n\n**1.** Создайте пост, чётко сформулировав Вашу просьбу или вопрос, а также не забудьте прикрепить к нему соответствующий тег.\n\n**2.** Ожидайте ответа.\n\n**3.** Обсуждение подошло к концу? Пропишите команду */resolved* прямо в посте, и наш бот <@1081285777562013817> закроет его, пометив тегом \"<:pyre_check:1085562978713219175> Resolved\".\n\nУчитесь сами и учите других!"
    }
}