{
    "description_en": "**Brief rundown on CEFR-based language proficiency levels**\n\n**Beginner A1-A2:** you are just starting to learn the language, with limited vocabulary and knowledge of basic grammar structures.\n\n**Intermediate B1-B2:** you are able to carry out simple conversations and understand basic written and spoken texts, with a wider range of vocabulary and a stronger grasp of grammar.\n\n**Advanced C1-C2:** you are able to engage in more complex conversations and understand more challenging written and spoken texts, with a broad range of vocabulary and a high level of grammatical accuracy.\n\n**Native Speaker:** you have learned the language from birth and have full proficiency in all aspects of the language.",
    "description_ru": "**Краткое описание уровней владения языком, основанное на системе CEFR**\n\n**Beginner A1-A2:** для тех, кто только начал изучать язык. Базовый вокабуляр и поверхностное знание грамматики.\n\n**Intermediate B1-B2:** знание языка на среднем уровне. Понимание простых текстов и повседневной устной речи, а также способность вести несложный диалог.\n\n**Advanced C1-C2:** углублённое владение всеми аспектами языка вне зависимости от языкового регистра.\n\n**Native Speaker:** для тех, кто окружён языком с детства и владеет им в качестве основного.",
    "he_preamble": "**Consider choosing this role if you have inherited the Russian language from your family rather than from external sources**\n\n**Роль для тех, кто усвоил русский в семье, а не из окружающей среды**\n\n",
    "he": "**Heritage Speaker**: you have been exposed to the language through your family, such as your parents, but may have gaps in knowledge or skills due to growing up in a different country or environment, and potentially due to switching your primary language.\n\n**Heritage Speaker:** если Вы росли в окружении русского со стороны родственников, в частности родителей, но не владеете языком в качестве основного.",
    "en": [
        1079410589924872223,
        1079412796602712085,
        1079412899887456337,
        1079413025519452190
    ],
    "ru": [
        1079413086965997639,
        1079413310203629628,
        1079413447432863886,
        1079413502617321574
    ],
    "unverified": 1081936187410894931
}